In [1]:
import  numpy as np
import seaborn as sns
import  tensorflow
from tensorflow import  keras
import  matplotlib.pyplot as plt
%matplotlib inline
import pandas as pd

In [36]:
mydata=pd.read_csv("Unemployment_Insurance_Average_Duration__Beginning_2002.csv")

In [37]:
mydata.sample(5)

       Year  Month         Region        County  Average Duration
4559   2007      4   Finger Lakes       Wyoming              15.1
3336   2005     11   Finger Lakes         Yates              16.5
832    2002     12  Mohawk Valley        Oneida              16.0
15583  2020      1  Hudson Valley        Ulster              14.5
1208   2003      5  North Country  St. Lawrence              17.3

In [38]:
my_class=['Year', 'Month','Region','County']

In [41]:
X=mydata.drop(my_class,axis='columns')
y=mydata.drop('Average Duration',axis='columns')

In [42]:
X_target.sample(4)

       Average Duration
453                15.0
6272               15.6
7688               18.8
15181              14.4

In [44]:
y.sample(5)

       Year  Month         Region                County
3200   2005      9  Hudson Valley           Westchester
11429  2015      3  North Country              Hamilton
12731  2016      9  Southern Tier               Chemung
13881  2018      1  Southern Tier  Southern Tier Region
2422   2004     10  New York City              New York